resource/sysbench/mysql_oltp_update_non_index.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 3089.44 qps: 3089.44 (r/w/o: 0.00/3089.44/0.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 2807.22 qps: 2807.22 (r/w/o: 0.00/2807.22/0.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 2931.99 qps: 2931.99 (r/w/o: 0.00/2931.99/0.00) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 2800.69 qps: 2800.69 (r/w/o: 0.00/2800.69/0.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 2685.85 qps: 2685.85 (r/w/o: 0.00/2685.85/0.00) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 2684.97 qps: 2684.97 (r/w/o: 0.00/2684.97/0.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           170038
        other:                           0
        total:                           170038
    transactions:                        170038 (2832.57 per sec.)
    queries:                             170038 (2832.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2832.5716
    time elapsed:                        60.0296s
    total number of events:              170038

Latency (ms):
         min:                                    0.56
         avg:                                   11.29
         max:                                  486.35
         95th percentile:                       42.61
         sum:                              1920247.70

Threads fairness:
    events (avg/stddev):           5313.6875/85.86
    execution time (avg/stddev):   60.0077/0.01