resource/sysbench/tidb_oltp_read_write.log
sysbench 1.1.0-faaff4f (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 502.01 qps: 10079.26 (r/w/o: 7059.01/2013.03/1007.22) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 505.90 qps: 10128.53 (r/w/o: 7094.92/2021.81/1011.80) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 434.50 qps: 8671.67 (r/w/o: 6065.05/1737.61/869.01) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 425.79 qps: 8511.73 (r/w/o: 5959.81/1700.35/851.57) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 448.85 qps: 8979.39 (r/w/o: 6283.90/1797.80/897.70) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 461.78 qps: 9252.43 (r/w/o: 6477.74/1851.13/923.56) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            389508
        write:                           111288
        other:                           55644
        total:                           556440
    transactions:                        27822  (463.47 per sec.)
    queries:                             556440 (9269.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      463.4726
    time elapsed:                        60.0294s
    total number of events:              27822

Latency (ms):
         min:                                   15.95
         avg:                                   69.02
         max:                                  219.02
         95th percentile:                       97.55
         sum:                              1920389.25

Threads fairness:
    events (avg/stddev):           869.4375/4.02
    execution time (avg/stddev):   60.0122/0.01